## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 8 to add, 6 to change, 4 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                         RESOURCE                         |
|----------|----------------------------------------------------------|
| add      | `aws_network_acl_rule.smtp_ssl_egress`                   |
|          | `aws_network_acl_rule.smtp_ssl_ingress`                  |
|          | `aws_ssm_parameter.smtp_password`                        |
|          | `aws_ssm_parameter.smtp_user`                            |
| update   | `module.celery_beat_ecs.aws_ecs_service.this`            |
|          | `module.celery_beat_ecs.aws_iam_policy.this_task_exec`   |
|          | `module.celery_worker_ecs.aws_ecs_service.this`          |
|          | `module.celery_worker_ecs.aws_iam_policy.this_task_exec` |
|          | `module.superset_ecs.aws_ecs_service.this`               |
|          | `module.superset_ecs.aws_iam_policy.this_task_exec`      |
| recreate | `aws_ecs_task_definition.superset_upgrade`               |
|          | `module.celery_beat_ecs.aws_ecs_task_definition.this`    |
|          | `module.celery_worker_ecs.aws_ecs_task_definition.this`  |
|          | `module.superset_ecs.aws_ecs_task_definition.this`       |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/cds-superset/actions/runs/16815091816).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.ecs_task_ssm_parameters will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ecs_task_ssm_parameters" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:ca-central-1:066023111852:parameter/google_oauth_client_id",
              + "arn:aws:ssm:ca-central-1:066023111852:parameter/google_oauth_client_secret",
              + "arn:aws:ssm:ca-central-1:066023111852:parameter/slack_api_token",
              + "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_host",
              + "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_password",
              + "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_username",
              + "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_secret_key",
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "GetSSMParameters"
        }
    }

  # aws_ecs_task_definition.superset_upgrade must be replaced
-/+ resource "aws_ecs_task_definition" "superset_upgrade" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset-upgrade:41" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset-upgrade" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - command          = [
                      - "/app/docker/docker-bootstrap.sh",
                      - "upgrade",
                    ]
                  - cpu              = 1024
                  - environment      = [
                      - {
                          - name  = "CACHE_WARMUP_EXECUTORS"
                          - value = "cache-warmer"
                        },
                      - {
                          - name  = "FLASK_DEBUG"
                          - value = "false"
                        },
                      - {
                          - name  = "GUNICORN_KEEPALIVE"
                          - value = "120"
                        },
                      - {
                          - name  = "REDIS_HOST"
                          - value = "superset-cache-prod.m4q4yy.ng.0001.cac1.cache.amazonaws.com"
                        },
                      - {
                          - name  = "REDIS_PORT"
                          - value = "6379"
                        },
                      - {
                          - name  = "SUPERSET_DATABASE_DB"
                          - value = "superset"
                        },
                      - {
                          - name  = "WEBDRIVER_BASEURL"
                          - value = "http://superset.superset.ecs.local:8088"
                        },
                      - {
                          - name  = "WEBDRIVER_BASEURL_USER_FRIENDLY"
                          - value = "https://superset.cds-snc.ca"
                        },
                    ]
                  - essential        = true
                  - image            = "066023111852.dkr.ecr.ca-central-1.amazonaws.com/superset:latest"
                  - linuxParameters  = {
                      - capabilities = {
                          - add  = []
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/superset/superset"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "upgrade"
                        }
                    }
                  - memory           = 2048
                  - mountPoints      = []
                  - name             = "superset-upgrade"
                  - portMappings     = [
                      - {
                          - containerPort = 8088
                          - hostPort      = 8088
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "SLACK_API_TOKEN"
                          - valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/slack_api_token"
                        },
                      - {
                          - name      = "SUPERSET_DATABASE_HOST"
                          - valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_host"
                        },
                      - {
                          - name      = "SUPERSET_DATABASE_PASSWORD"
                          - valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_password"
                        },
                      - {
                          - name      = "SUPERSET_DATABASE_USER"
                          - valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_username"
                        },
                      - {
                          - name      = "SUPERSET_SECRET_KEY"
                          - valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_secret_key"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "superset-upgrade" -> (known after apply)
      ~ revision                 = 41 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_network_acl_rule.smtp_ssl_egress will be created
  + resource "aws_network_acl_rule" "smtp_ssl_egress" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 465
      + id             = (known after apply)
      + network_acl_id = "acl-0a5d894d56fb1739e"
      + protocol       = "tcp"
      + region         = "ca-central-1"
      + rule_action    = "allow"
      + rule_number    = 110
      + to_port        = 465
    }

  # aws_network_acl_rule.smtp_ssl_ingress will be created
  + resource "aws_network_acl_rule" "smtp_ssl_ingress" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 465
      + id             = (known after apply)
      + network_acl_id = "acl-0a5d894d56fb1739e"
      + protocol       = "tcp"
      + region         = "ca-central-1"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 465
    }

  # aws_ssm_parameter.smtp_password will be created
  + resource "aws_ssm_parameter" "smtp_password" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "smtp_password"
      + region         = "ca-central-1"
      + tags           = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.smtp_user will be created
  + resource "aws_ssm_parameter" "smtp_user" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "smtp_user"
      + region         = "ca-central-1"
      + tags           = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.celery_beat_ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + region                   = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "celery-beat"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.celery_beat_ecs.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:GetAuthorizationToken",
                              + "ecr:BatchGetImage",
                              + "ecr:BatchCheckLayerAvailability",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "logs:DescribeLogGroups"
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                      + {
                          + Action   = [
                              + "logs:PutLogEvents",
                              + "logs:DescribeLogStreams",
                              + "logs:CreateLogStream",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:logs:ca-central-1:066023111852:log-group:/aws/ecs/superset/celery-beat:*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
        ]
    }

  # module.celery_beat_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/celery-beat"
        name                               = "celery-beat"
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "celery-beat:147" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.celery_beat_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-beat:146" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-beat" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - command                = [
                      - "/app/docker/docker-bootstrap.sh",
                      - "beat",
                    ]
                  - environment            = [
                      - {
                          - name  = "CACHE_WARMUP_EXECUTORS"
                          - value = "cache-warmer"
                        },
                      - {
                          - name  = "FLASK_DEBUG"
                          - value = "false"
                        },
                      - {
                          - name  = "GUNICORN_KEEPALIVE"
                          - value = "120"
                        },
                      - {
                          - name  = "REDIS_HOST"
                          - value = "superset-cache-prod.m4q4yy.ng.0001.cac1.cache.amazonaws.com"
                        },
                      - {
                          - name  = "REDIS_PORT"
                          - value = "6379"
                        },
                      - {
                          - name  = "SUPERSET_DATABASE_DB"
                          - value = "superset"
                        },
                      - {
                          - name  = "WEBDRIVER_BASEURL"
                          - value = "http://superset.superset.ecs.local:8088"
                        },
                      - {
                          - name  = "WEBDRIVER_BASEURL_USER_FRIENDLY"
                          - value = "https://superset.cds-snc.ca"
                        },
                    ]
                  - essential              = true
                  - image                  = "066023111852.dkr.ecr.ca-central-1.amazonaws.com/superset:latest"
                  - linuxParameters        = {
                      - capabilities = {
                          - add  = []
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration       = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/superset/celery-beat"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "task"
                        }
                    }
                  - mountPoints            = []
                  - name                   = "celery-beat"
                  - portMappings           = [
                      - {
                          - containerPort = 8088
                          - hostPort      = 8088
                          - protocol      = "tcp"
                        },
                    ]
                  - readonlyRootFilesystem = false
                  - secrets                = [
                      - {
                          - name      = "SLACK_API_TOKEN"
                          - valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/slack_api_token"
                        },
                      - {
                          - name      = "SUPERSET_DATABASE_HOST"
                          - valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_host"
                        },
                      - {
                          - name      = "SUPERSET_DATABASE_PASSWORD"
                          - valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_password"
                        },
                      - {
                          - name      = "SUPERSET_DATABASE_USER"
                          - valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_username"
                        },
                      - {
                          - name      = "SUPERSET_SECRET_KEY"
                          - valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_secret_key"
                        },
                    ]
                  - systemControls         = []
                  - volumesFrom            = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "celery-beat" -> (known after apply)
      ~ revision                 = 146 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.celery_beat_ecs.aws_iam_policy.this_task_exec will be updated in-place
  ~ resource "aws_iam_policy" "this_task_exec" {
        id               = "arn:aws:iam::066023111852:policy/celery-beat_ecs_task_exec_policy"
        name             = "celery-beat_ecs_task_exec_policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "logs:DescribeLogGroups"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:066023111852:log-group:/aws/ecs/superset/celery-beat:*"
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_secret_key",
                          - "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_username",
                          - "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_password",
                          - "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_host",
                          - "arn:aws:ssm:ca-central-1:066023111852:parameter/slack_api_token",
                          - "arn:aws:ssm:ca-central-1:066023111852:parameter/google_oauth_client_secret",
                          - "arn:aws:ssm:ca-central-1:066023111852:parameter/google_oauth_client_id",
                        ]
                      - Sid      = "GetSSMParameters"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.celery_worker_ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + region                   = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "celery-worker"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.celery_worker_ecs.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:GetAuthorizationToken",
                              + "ecr:BatchGetImage",
                              + "ecr:BatchCheckLayerAvailability",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "logs:DescribeLogGroups"
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                      + {
                          + Action   = [
                              + "logs:PutLogEvents",
                              + "logs:DescribeLogStreams",
                              + "logs:CreateLogStream",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:logs:ca-central-1:066023111852:log-group:/aws/ecs/superset/celery-worker:*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
        ]
    }

  # module.celery_worker_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/celery-worker"
        name                               = "celery-worker"
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "celery-worker:150" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.celery_worker_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-worker:149" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-worker" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - command                = [
                      - "/app/docker/docker-bootstrap.sh",
                      - "worker",
                    ]
                  - environment            = [
                      - {
                          - name  = "CACHE_WARMUP_EXECUTORS"
                          - value = "cache-warmer"
                        },
                      - {
                          - name  = "FLASK_DEBUG"
                          - value = "false"
                        },
                      - {
                          - name  = "GUNICORN_KEEPALIVE"
                          - value = "120"
                        },
                      - {
                          - name  = "REDIS_HOST"
                          - value = "superset-cache-prod.m4q4yy.ng.0001.cac1.cache.amazonaws.com"
                        },
                      - {
                          - name  = "REDIS_PORT"
                          - value = "6379"
                        },
                      - {
                          - name  = "SUPERSET_DATABASE_DB"
                          - value = "superset"
                        },
                      - {
                          - name  = "WEBDRIVER_BASEURL"
                          - value = "http://superset.superset.ecs.local:8088"
                        },
                      - {
                          - name  = "WEBDRIVER_BASEURL_USER_FRIENDLY"
                          - value = "https://superset.cds-snc.ca"
                        },
                    ]
                  - essential              = true
                  - image                  = "066023111852.dkr.ecr.ca-central-1.amazonaws.com/superset:latest"
                  - linuxParameters        = {
                      - capabilities = {
                          - add  = []
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration       = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/superset/celery-worker"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "task"
                        }
                    }
                  - mountPoints            = []
                  - name                   = "celery-worker"
                  - portMappings           = [
                      - {
                          - containerPort = 8088
                          - hostPort      = 8088
                          - protocol      = "tcp"
                        },
                    ]
                  - readonlyRootFilesystem = false
                  - secrets                = [
                      - {
                          - name      = "SLACK_API_TOKEN"
                          - valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/slack_api_token"
                        },
                      - {
                          - name      = "SUPERSET_DATABASE_HOST"
                          - valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_host"
                        },
                      - {
                          - name      = "SUPERSET_DATABASE_PASSWORD"
                          - valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_password"
                        },
                      - {
                          - name      = "SUPERSET_DATABASE_USER"
                          - valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_username"
                        },
                      - {
                          - name      = "SUPERSET_SECRET_KEY"
                          - valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_secret_key"
                        },
                    ]
                  - systemControls         = []
                  - volumesFrom            = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "celery-worker" -> (known after apply)
      ~...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake[\"production\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset_cache"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.superset_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.superset_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.label_sizerestrictions_body_excluded_paths"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_ssm_parameter.sentinel_forwarder_auth"]

31 tests, 19 passed, 12 warnings, 0 failures, 0 exceptions

```

</details>
